Revit 2027 API
MassInstanceUtils.RemoveMassLevelDataFromMassInstance Method
 Delete the MassLevelData (Mass Floor) that associates a Level with a mass instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RemoveMassLevelDataFromMassInstance(
	Document document,
	ElementId massInstanceId,
	ElementId levelId
)
Public Shared Sub RemoveMassLevelDataFromMassInstance (
	document As Document,
	massInstanceId As ElementId,
	levelId As ElementId
)
public:
static void RemoveMassLevelDataFromMassInstance(
	Document^ document,
	ElementId^ massInstanceId,
	ElementId^ levelId
)
static member RemoveMassLevelDataFromMassInstance :
        document : Document *
        massInstanceId : ElementId *
        levelId : ElementId -> unit
Parameters
document Document
 The Document.
massInstanceId ElementId
 The ElementId of the mass instance.
levelId ElementId
 The ElementId of the Level to disassociate from the mass instance.
Exceptions
Exception | Condition
ArgumentException |  The ElementId massInstanceId is not a mass instance. -or- The ElementId levelId is not a Level.
ArgumentNullException |  A non-optional argument was null
Remarks
 Alternatively, you could just delete the MassLevelData.
See Also
Reference
MassInstanceUtils Class
Autodesk.Revit.DB Namespace